scarab/examples.org
#+TITLE: Scarab: Program Examples
#+AUTHOR: [[http://kix.istc.kobe-u.ac.jp/~soh/][Takehide Soh]]

#+INCLUDE: "./title.html" quote
#+OPTIONS: ^:nil toc:nil H:2 num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../myhome.css" />

* Latin Square
 #+BEGIN_SRC scala
import jp.kobe_u.scarab._, dsl._

var n: Int = 5
for (i <- 0 until n; j <- 0 until n) int('x (i, j), 1, n)
for (i <- 0 until n) {
  add(alldiff((0 until n).map(j => 'x (i, j))))
  add(alldiff((0 until n).map(j => 'x (j, i))))
  add(alldiff((0 until n).map(j => 'x (j, (i + j) % n))))
  add(alldiff((0 until n).map(j => 'x (j, ((n - 1 + i - j)) % n))))
}

if (find)
  for (i <- 0 until n)
    println((0 until n).map { j => solution.intMap('x (i, j)) }.mkString(" "))
 #+END_SRC
*** (Lines 1 to 3) import Scarab classes
*** (Line 6) declare integer variables
*** (Lines 8 to 11) add alldifferenct constraints for each row, column, and diagonal
*** (Line 12) print found solution if it exists
* Square Packing
  #+BEGIN_SRC scala
import jp.kobe_u.scarab._, dsl._

val n = 15; val s =36 

for (i <- 1 to n)  { int('x(i),0,s-i) ; int('y(i),0,s-i) }
for (i <- 1 to n; j <- i+1 to n) 
  add(('x(i)+i <='x(j)) || ('x(j)+j<='x(i)) || ('y(i)+i<='y(j)) || ('y(j)+j<='y(i)))

if (find) println(solution.intMap) 
  #+END_SRC
*** (Lines 1 to 3) import Scarab classes
*** (Line 7) declare integer variables
*** (Lines 8 and 9) add non-overlaping constraints
*** (Line 11) print found solution if it exists

# ** Magic Square of Size 3
#   #+BEGIN_SRC scala -n
# import jp.kobe_u.scarab.csp._
# import jp.kobe_u.scarab.solver._
# import jp.kobe_u.scarab.sapp._

# val xs = for (i <- 1 to 3; j <- 1 to 3) yield int('x(i,j), 1, 9)
# add(alldiff(xs))
# for (i <- 1 to 3) add(Sum((1 to 3).map(j => 'x(i,j))) === 15)
# for (j <- 1 to 3) add(Sum((1 to 3).map(i => 'x(i,j))) === 15)
# add(Sum((1 to 3).map(i => 'x(i,i))) === 15)
# add(Sum((1 to 3).map(i => 'x(i,4-i))) === 15)

# if (find)  println(solution)
#   #+END_SRC
# *** (Lines 1 to 3) import Scarab classes
# *** (Line 5) define integer variables and define "xs" as a list of them
# *** (Line 6) add alldifferenct constraint for all variables
# *** (Lines 7 to 10) add constraints so that each sum for each row, column, and diagonal become 15
# *** (Line 12) print found solution if it exists
* Langford Pairing
#When $2n$ numbers $\{1, 1, 2, 2, \ldots, n, n\}$ are given, (see also http://www.csplib.org)
** Model 1
#+BEGIN_SRC scala
import jp.kobe_u.scarab._, dsl._

val n = 4

for (i <- 1 to 2*n) int('x(i),1,n)
for (i <- 1 to n) 
  add(Or(for (j <- 1 to 2*n-i-1) yield And(('x(j) === 'x(j+i+1)), ('x(j) === i))))

if(find) println(solution)
#+END_SRC
*** (Line 7) declare integer variables representing each of $2n$ positions has which number.
** Model 2 (with position variable)
#+BEGIN_SRC scala
import jp.kobe_u.scarab._, dsl._

val n = 4

for (i <- 1 to n) { 
  int('l(i),1,2*n-i-1)
  int('r(i),1,2*n) 
}

for (i <- 1 to n)  add('l(i) === 'r(i)-i-1)
add(alldiff((1 to n).map(i => 'l(i))))
add(alldiff((1 to n).map(i => 'r(i))))

if(find) println(solution)
#+END_SRC
*** (Lines 7 to 10) declare integer variables representing each pairs of $n$ numbers are placed to which positions.
* Graph Coloring
#+BEGIN_SRC scala
import jp.kobe_u.scarab._, dsl._

val nodes = Seq(1,2,3,4,5)
val edges = Seq((1,2),(1,5),(2,3),(2,4),(3,4),(4,5))
var maxColor = 4;

int('color,1,maxColor)
for (i <- nodes) int('n(i),1,maxColor)
for (i <- nodes) add('n(i) <= 'color)
for ((i,j) <- edges)  add('n(i) !== 'n(j))

while (find('color <= maxColor)) {
  println(solution)
  maxColor -= 1
}
#+END_SRC
*** (Lines 5 to 7) declare graph structure.
