scarab/examples.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-01 水 14:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Scarab: Program Examples</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="[[http://kix.istc.kobe-u.ac.jp/~soh/][Takehide Soh]]Takehide Soh" />
<table class="menu" border="0" cellspacing="0" cellpadding="20" width="900px">
<tr>
<td class="menu" bgcolor="#3B5998"><a href="index.html">Home</a></td>
<td class="menu" bgcolor="#3B5998"><a href="examples.html">Examples</a></td>
<td class="menu" bgcolor="#3B5998"><a href="doc.html">Documents</a></td>
<td class="menu" bgcolor="#3B5998"><a href="advanced.html">Advanced Usage</a></td>
<td class="menu" bgcolor="#3B5998"><a href="tutorial.html">Tutorial</a></td>
<td class="menu" bgcolor="#3B5998"><a href="apps.html">Apps</a></td>
</tr>
</table>
<div id="content">
<link rel="stylesheet" type="text/css" href="../myhome.css" />
</head>
<body>
<div id="content">
<h1 class="title">Scarab: Program Examples</h1>

<div id="outline-container-org00fe605" class="outline-2">
<h2 id="org00fe605">Latin Square</h2>
<div class="outline-text-2" id="text-org00fe605">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab.<span style="color: #a020f0;">_</span>, dsl.<span style="color: #a020f0;">_</span>

<span style="color: #a020f0;">var</span> <span style="color: #ff0000; font-weight: bold;">n</span><span style="color: #a020f0;">:</span> <span style="color: #228b22;">Int</span> <span style="color: #a020f0;">=</span> <span style="color: #008b8b;">5</span>
<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n; j <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n) int(<span style="color: #8b2252;">'x</span> (i, j), <span style="color: #008b8b;">1</span>, n)
<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n) {
  add(alldiff((<span style="color: #008b8b;">0</span> until n).map(j <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'x</span> (i, j))))
  add(alldiff((<span style="color: #008b8b;">0</span> until n).map(j <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'x</span> (j, i))))
  add(alldiff((<span style="color: #008b8b;">0</span> until n).map(j <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'x</span> (j, (i + j) % n))))
  add(alldiff((<span style="color: #008b8b;">0</span> until n).map(j <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'x</span> (j, ((n - <span style="color: #008b8b;">1</span> + i - j)) % n))))
}

<span style="color: #a020f0;">if</span> (find)
  <span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n)
    println((<span style="color: #008b8b;">0</span> until n).map { j <span style="color: #a020f0;">=&gt;</span> solution.intMap(<span style="color: #8b2252;">'x</span> (i, j)) }.mkString(<span style="color: #8b2252;">" "</span>))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org40436cc"></a>(Lines 1 to 3) import Scarab classes<br /></li>
<li><a id="orgd8e5cc7"></a>(Line 6) declare integer variables<br /></li>
<li><a id="orgb6b3701"></a>(Lines 8 to 11) add alldifferenct constraints for each row, column, and diagonal<br /></li>
<li><a id="org6ba98f7"></a>(Line 12) print found solution if it exists<br /></li>
</ul>
</div>
<div id="outline-container-org10a3549" class="outline-2">
<h2 id="org10a3549">Square Packing</h2>
<div class="outline-text-2" id="text-org10a3549">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab.<span style="color: #a020f0;">_</span>, dsl.<span style="color: #a020f0;">_</span>

<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">n</span> <span style="color: #a020f0;">=</span> <span style="color: #008b8b;">15</span>; <span style="color: #a020f0;">val</span> <span style="color: #a0522d;">s</span> <span style="color: #a020f0;">=</span><span style="color: #008b8b;">36</span> 

<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to n)  { int(<span style="color: #8b2252;">'x</span>(i),<span style="color: #008b8b;">0</span>,s-i) ; int(<span style="color: #8b2252;">'y</span>(i),<span style="color: #008b8b;">0</span>,s-i) }
<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to n; j <span style="color: #a020f0;">&lt;-</span> i+<span style="color: #008b8b;">1</span> to n) 
  add((<span style="color: #8b2252;">'x</span>(i)+i &lt;=<span style="color: #8b2252;">'x</span>(j)) || (<span style="color: #8b2252;">'x</span>(j)+j&lt;=<span style="color: #8b2252;">'x</span>(i)) || (<span style="color: #8b2252;">'y</span>(i)+i&lt;=<span style="color: #8b2252;">'y</span>(j)) || (<span style="color: #8b2252;">'y</span>(j)+j&lt;=<span style="color: #8b2252;">'y</span>(i)))

<span style="color: #a020f0;">if</span> (find) println(solution.intMap) 
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orge3ce394"></a>(Lines 1 to 3) import Scarab classes<br /></li>
<li><a id="org09e2898"></a>(Line 7) declare integer variables<br /></li>
<li><a id="org70909f7"></a>(Lines 8 and 9) add non-overlaping constraints<br /></li>
<li><a id="org23899e6"></a>(Line 11) print found solution if it exists<br />
<div class="outline-text-4" id="text-org23899e6">
</div>
</li>
</ul>
</div>
<div id="outline-container-org7e35962" class="outline-2">
<h2 id="org7e35962">Langford Pairing</h2>
<div class="outline-text-2" id="text-org7e35962">
<p>
#When \(2n\) numbers \(\{1, 1, 2, 2, \ldots, n, n\}\) are given, (see also <a href="http://www.csplib.org">http://www.csplib.org</a>)
</p>
</div>
<div id="outline-container-orgffda96a" class="outline-3">
<h3 id="orgffda96a">Model 1</h3>
<div class="outline-text-3" id="text-orgffda96a">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab.<span style="color: #a020f0;">_</span>, dsl.<span style="color: #a020f0;">_</span>

<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">n</span> <span style="color: #a020f0;">=</span> <span style="color: #008b8b;">4</span>

<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to <span style="color: #008b8b;">2</span>*n) int(<span style="color: #8b2252;">'x</span>(i),<span style="color: #008b8b;">1</span>,n)
<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to n) 
  add(<span style="color: #008b8b;">Or</span>(<span style="color: #a020f0;">for</span> (j <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to <span style="color: #008b8b;">2</span>*n-i-1) <span style="color: #a020f0;">yield</span> <span style="color: #008b8b;">And</span>((<span style="color: #8b2252;">'x</span>(j) === <span style="color: #8b2252;">'x</span>(j+i+<span style="color: #008b8b;">1</span>)), (<span style="color: #8b2252;">'x</span>(j) === i))))

<span style="color: #a020f0;">if</span>(find) println(solution)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org05d4002"></a>(Line 7) declare integer variables representing each of \(2n\) positions has which number.<br /></li>
</ul>
</div>
<div id="outline-container-orgcb208c6" class="outline-3">
<h3 id="orgcb208c6">Model 2 (with position variable)</h3>
<div class="outline-text-3" id="text-orgcb208c6">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab.<span style="color: #a020f0;">_</span>, dsl.<span style="color: #a020f0;">_</span>

<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">n</span> <span style="color: #a020f0;">=</span> <span style="color: #008b8b;">4</span>

<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to n) { 
  int(<span style="color: #8b2252;">'l</span>(i),<span style="color: #008b8b;">1</span>,<span style="color: #008b8b;">2</span>*n-i-1)
  int(<span style="color: #8b2252;">'r</span>(i),<span style="color: #008b8b;">1</span>,<span style="color: #008b8b;">2</span>*n) 
}

<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to n)  add(<span style="color: #8b2252;">'l</span>(i) === <span style="color: #8b2252;">'r</span>(i)-i-1)
add(alldiff((<span style="color: #008b8b;">1</span> to n).map(i <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'l</span>(i))))
add(alldiff((<span style="color: #008b8b;">1</span> to n).map(i <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'r</span>(i))))

<span style="color: #a020f0;">if</span>(find) println(solution)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org857ba0d"></a>(Lines 7 to 10) declare integer variables representing each pairs of \(n\) numbers are placed to which positions.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org8bbd76a" class="outline-2">
<h2 id="org8bbd76a">Graph Coloring</h2>
<div class="outline-text-2" id="text-org8bbd76a">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab.<span style="color: #a020f0;">_</span>, dsl.<span style="color: #a020f0;">_</span>

<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">nodes</span> <span style="color: #a020f0;">=</span> <span style="color: #008b8b;">Seq</span>(<span style="color: #008b8b;">1</span>,<span style="color: #008b8b;">2</span>,<span style="color: #008b8b;">3</span>,<span style="color: #008b8b;">4</span>,<span style="color: #008b8b;">5</span>)
<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">edges</span> <span style="color: #a020f0;">=</span> <span style="color: #008b8b;">Seq</span>((<span style="color: #008b8b;">1</span>,<span style="color: #008b8b;">2</span>),(<span style="color: #008b8b;">1</span>,<span style="color: #008b8b;">5</span>),(<span style="color: #008b8b;">2</span>,<span style="color: #008b8b;">3</span>),(<span style="color: #008b8b;">2</span>,<span style="color: #008b8b;">4</span>),(<span style="color: #008b8b;">3</span>,<span style="color: #008b8b;">4</span>),(<span style="color: #008b8b;">4</span>,<span style="color: #008b8b;">5</span>))
<span style="color: #a020f0;">var</span> <span style="color: #ff0000; font-weight: bold;">maxColor</span> <span style="color: #a020f0;">=</span> <span style="color: #008b8b;">4</span>;

int(<span style="color: #8b2252;">'color</span>,<span style="color: #008b8b;">1</span>,maxColor)
<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> nodes) int(<span style="color: #8b2252;">'n</span>(i),<span style="color: #008b8b;">1</span>,maxColor)
<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> nodes) add(<span style="color: #8b2252;">'n</span>(i) &lt;= <span style="color: #8b2252;">'color</span>)
<span style="color: #a020f0;">for</span> ((i,j) <span style="color: #a020f0;">&lt;-</span> edges)  add(<span style="color: #8b2252;">'n</span>(i) !== <span style="color: #8b2252;">'n</span>(j))

<span style="color: #a020f0;">while</span> (find(<span style="color: #8b2252;">'color</span> &lt;= maxColor)) {
  println(solution)
  maxColor -= <span style="color: #008b8b;">1</span>
}
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgb8cf12d"></a>(Lines 5 to 7) declare graph structure.<br /></li>
