scarab/examples.html
<li><a id="org7717107"></a>(Lines 9 and 10) declare integer variables representing available colors and each node of the given graph.<br /></li>
<li><a id="org849e66e"></a>(Lines 11 and 12) declare constraints that limit available colors and adjacent nodes have different color.<br /></li>
<li><a id="orgbf33ffb"></a>(Lines 14 to 17) minimizing number of colors.<br /></li>
</ul>
</div>
<div id="outline-container-orga23a980" class="outline-2">
<h2 id="orga23a980">Magic Square</h2>
<div class="outline-text-2" id="text-orga23a980">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab.<span style="color: #a020f0;">_</span>, dsl.<span style="color: #a020f0;">_</span>

<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">xs</span> <span style="color: #a020f0;">=</span> <span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to <span style="color: #008b8b;">3</span>; j <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to <span style="color: #008b8b;">3</span>) <span style="color: #a020f0;">yield</span> csp.int(<span style="color: #8b2252;">'x</span>(i,j), <span style="color: #008b8b;">1</span>, <span style="color: #008b8b;">9</span>)
  add(alldiff(xs))

<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to <span style="color: #008b8b;">3</span>)
  add(<span style="color: #008b8b;">Sum</span>((<span style="color: #008b8b;">1</span> to <span style="color: #008b8b;">3</span>).map(j <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'x</span>(i,j))) === <span style="color: #008b8b;">15</span>)
<span style="color: #a020f0;">for</span> (j <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to <span style="color: #008b8b;">3</span>)
  add(<span style="color: #008b8b;">Sum</span>((<span style="color: #008b8b;">1</span> to <span style="color: #008b8b;">3</span>).map(i <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'x</span>(i,j))) === <span style="color: #008b8b;">15</span>)
add(<span style="color: #008b8b;">Sum</span>((<span style="color: #008b8b;">1</span> to <span style="color: #008b8b;">3</span>).map(i <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'x</span>(i,i))) === <span style="color: #008b8b;">15</span>)
add(<span style="color: #008b8b;">Sum</span>((<span style="color: #008b8b;">1</span> to <span style="color: #008b8b;">3</span>).map(i <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'x</span>(i,<span style="color: #008b8b;">4</span>-i))) === <span style="color: #008b8b;">15</span>)

<span style="color: #a020f0;">if</span> (find) println(solution)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org15c860b"></a>(Lines 1 to 3) import Scarab classes<br /></li>
<li><a id="org6da19d2"></a>(Line 5) declare integer variables and puts them to xs<br /></li>
<li><a id="org774dd95"></a>(Line 6) declare alldiff for the variables<br /></li>
<li><a id="org0cdfc3f"></a>(Lines 8 and 11) add constraints such that the sum for each row and column become 15<br /></li>
<li><a id="org01aaa66"></a>(Line 12 and 13) add constraints such that the sum for each main diagonal become 15<br /></li>
<li><a id="org203ffd7"></a>(Line 15) print found solution if it exists<br />
<div class="outline-text-4" id="text-org203ffd7">
</div>
</li>
</ul>
</div>
<div id="outline-container-org717e1ce" class="outline-2">
<h2 id="org717e1ce">Alphametic Problem <b>SAT + IS + FUN = TRUE</b></h2>
<div class="outline-text-2" id="text-org717e1ce">
<p>
\(S*100 + A*10 + T + I*10 + S + F*100 + U*10 + N = T*1000 + R*100 + U*10 + E\)
</p>
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab.<span style="color: #a020f0;">_</span>, dsl.<span style="color: #a020f0;">_</span>

<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">base</span> <span style="color: #a020f0;">=</span> <span style="color: #008b8b;">10</span>

<span style="color: #a020f0;">for</span> (v <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">Seq</span>(<span style="color: #8b2252;">'s</span>,<span style="color: #8b2252;">'i</span>,<span style="color: #8b2252;">'f</span>,<span style="color: #8b2252;">'t</span>)) <span style="color: #a020f0;">yield</span> int(v,<span style="color: #008b8b;">1</span>,base-1)     <span style="color: #b22222;">// </span><span style="color: #b22222;">S, I, F and T are not zero</span>
<span style="color: #a020f0;">for</span> (v <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">Seq</span>(<span style="color: #8b2252;">'a</span>,<span style="color: #8b2252;">'u</span>,<span style="color: #8b2252;">'n</span>,<span style="color: #8b2252;">'r</span>,<span style="color: #8b2252;">'e</span>)) <span style="color: #a020f0;">yield</span> int(v,<span style="color: #008b8b;">0</span>,base-1)  <span style="color: #b22222;">// </span><span style="color: #b22222;">others can be zero</span>
<span style="color: #a020f0;">for</span> (v <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">Seq</span>(<span style="color: #8b2252;">'c1</span>,<span style="color: #8b2252;">'c2</span>,<span style="color: #8b2252;">'c3</span>)) <span style="color: #a020f0;">yield</span> int(v,<span style="color: #008b8b;">0</span>,<span style="color: #008b8b;">2</span>)          <span style="color: #b22222;">// </span><span style="color: #b22222;">carries</span>

add(<span style="color: #8b2252;">'t</span> + <span style="color: #8b2252;">'s</span> + <span style="color: #8b2252;">'n</span>       === <span style="color: #8b2252;">'e</span> + <span style="color: #8b2252;">'c1</span>*base)
add(<span style="color: #8b2252;">'a</span> + <span style="color: #8b2252;">'i</span> + <span style="color: #8b2252;">'u</span> + <span style="color: #8b2252;">'c1</span> === <span style="color: #8b2252;">'u</span> + <span style="color: #8b2252;">'c2</span>*base)
add(<span style="color: #8b2252;">'s</span> +      <span style="color: #8b2252;">'f</span> + <span style="color: #8b2252;">'c2</span> === <span style="color: #8b2252;">'r</span> + <span style="color: #8b2252;">'c3</span>*base)
add(               <span style="color: #8b2252;">'c3</span> === <span style="color: #8b2252;">'t</span>)

add(alldiff(<span style="color: #008b8b;">Seq</span>(<span style="color: #8b2252;">'s</span>,<span style="color: #8b2252;">'i</span>,<span style="color: #8b2252;">'f</span>,<span style="color: #8b2252;">'t</span>,<span style="color: #8b2252;">'a</span>,<span style="color: #8b2252;">'u</span>,<span style="color: #8b2252;">'n</span>,<span style="color: #8b2252;">'r</span>,<span style="color: #8b2252;">'e</span>)))

<span style="color: #a020f0;">if</span> (find)  println(solution.intMap)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org851f6e9"></a>(Lines 11 to 14) constraint model considering each digit and carry, which takes around 1 second;)<br /></li>
</ul>
</div>
<div id="outline-container-org082c6eb" class="outline-2">
<h2 id="org082c6eb">Open-shop Scheduling</h2>
<div class="outline-text-2" id="text-org082c6eb">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab.<span style="color: #a020f0;">_</span>, dsl.<span style="color: #a020f0;">_</span>

use(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">Sat4j</span>(<span style="color: #8b2252;">"glucose"</span>))

<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">pt</span> <span style="color: #a020f0;">=</span> <span style="color: #008b8b;">Seq</span>(
  <span style="color: #008b8b;">Seq</span>(<span style="color: #008b8b;">661</span>,   <span style="color: #008b8b;">6</span>, <span style="color: #008b8b;">333</span>),
  <span style="color: #008b8b;">Seq</span>(<span style="color: #008b8b;">168</span>, <span style="color: #008b8b;">489</span>, <span style="color: #008b8b;">343</span>),
  <span style="color: #008b8b;">Seq</span>(<span style="color: #008b8b;">171</span>, <span style="color: #008b8b;">505</span>, <span style="color: #008b8b;">324</span>))

<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">n</span> <span style="color: #a020f0;">=</span> pt.size
<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">lb</span> <span style="color: #a020f0;">=</span> pt.map(<span style="color: #a020f0;">_</span>.sum).max
<span style="color: #a020f0;">var</span> <span style="color: #ff0000; font-weight: bold;">ub</span> <span style="color: #a020f0;">=</span> (<span style="color: #008b8b;">0</span> until n).map(k <span style="color: #a020f0;">=&gt;</span> (<span style="color: #008b8b;">0</span> until n).map(i <span style="color: #a020f0;">=&gt;</span> pt(i)((i + k) % n)).max).sum

int(<span style="color: #8b2252;">'makespan</span>, lb, ub)

<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n; j <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n) {
  int(<span style="color: #8b2252;">'s</span>(i,j), <span style="color: #008b8b;">0</span>, ub)
  add(<span style="color: #8b2252;">'s</span>(i,j) + pt(i)(j) &lt;= <span style="color: #8b2252;">'makespan</span>)
}
<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n) {
  <span style="color: #a020f0;">for</span> (j <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n; l <span style="color: #a020f0;">&lt;-</span> j+<span style="color: #008b8b;">1</span> until n)
    add(<span style="color: #8b2252;">'s</span>(i,j) + pt(i)(j) &lt;= <span style="color: #8b2252;">'s</span>(i,l) ||
        <span style="color: #8b2252;">'s</span>(i,l) + pt(i)(l) &lt;= <span style="color: #8b2252;">'s</span>(i,j))
}
<span style="color: #a020f0;">for</span> (j <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n) {
  <span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n; k <span style="color: #a020f0;">&lt;-</span> i+<span style="color: #008b8b;">1</span> until n)
    add(<span style="color: #8b2252;">'s</span>(i,j) + pt(i)(j) &lt;= <span style="color: #8b2252;">'s</span>(k,j) ||
        <span style="color: #8b2252;">'s</span>(k,j) + pt(k)(j) &lt;= <span style="color: #8b2252;">'s</span>(i,j))
}

<span style="color: #a020f0;">while</span> (find(<span style="color: #8b2252;">'makespan</span> &lt;= ub)) {
  println(solution)
  <span style="color: #a020f0;">val</span> <span style="color: #a0522d;">end</span> <span style="color: #a020f0;">=</span> (<span style="color: #a020f0;">for</span>(i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n; j <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">0</span> until n) 
             <span style="color: #a020f0;">yield</span> solution.intMap(<span style="color: #8b2252;">'s</span>(i,j))+pt(i)(j)).max
  ub <span style="color: #a020f0;">=</span> end - <span style="color: #008b8b;">1</span>
  println(ub)
}
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org0074002"></a>(Lines 1 to 3) import Scarab classes<br /></li>
<li><a id="org9b06397"></a>(Lines 7 to 10) declare an instance<br /></li>
