scarab/examples.org
*** (Lines 12 to 14) compute size, lower and upper bounds of the instance
*** (Line 16) declares an integer variable representing current makespan
*** (Lines 18 to 21) forces all operations are ended before makespan
*** (Lines 22 to 26) forces for operations in the same job do not overlap each other
*** (Lines 27 to 31) forces for operations sharing same resource do not overlap each other
*** (Lines 33 to 38) coumputes optimum solution
* Colored N Queen
  #+BEGIN_SRC scala
import jp.kobe_u.scarab._, dsl._

val n = args(0).toInt
val c = n

use(new Sat4j("glucose"))

for (i <- 1 to n; color <- 1 to c)
  int('q(i,color), 1, c)

for (color <- 1 to c) {
  add(alldiff((1 to n).map(i => 'q(i,color))))
  add(alldiff((1 to n).map(i => 'q(i,color)+i)))
  add(alldiff((1 to n).map(i => 'q(i,color)-i)))
}

for (i <- 1 to n)
  add(alldiff((1 to c).map(color => 'q(i,color))))

if (find) {
  for (color <- 1 to c) {
    for (row <- 1 to n) {
      var seq: Seq[Int] = Seq.empty
      for (column <- 1 to n)
	if (encoder.decode('q(row,color)) == column)
	  seq = seq :+ color
	else
	  seq = seq :+ 0
      println(seq.mkString(" "))
    }
    println("-----------------")
  }
}
  #+END_SRC
*** (Lines 1 to 3) import Scarab classes
*** (Lines 5 to 6) size is given from command line
*** (Lines 8) declares the use of Sat4j of Glucose setting.
*** (Lines 10 to 11) declares integer variables representing queens
*** (Lines 13 to 17) representing N-Queen constraints for each color
*** (Lines 19 to 20) forces that Queens of each color do no overlap
*** (Lines 22 to 35) compute solutions and show the obtained placement

