scarab/examples.html
<li><a id="orgc5c4931"></a>(Lines 12 to 14) compute size, lower and upper bounds of the instance<br /></li>
<li><a id="org6b43f2d"></a>(Line 16) declares an integer variable representing current makespan<br /></li>
<li><a id="org3341e8d"></a>(Lines 18 to 21) forces all operations are ended before makespan<br /></li>
<li><a id="org337b6b6"></a>(Lines 22 to 26) forces for operations in the same job do not overlap each other<br /></li>
<li><a id="org7d4e093"></a>(Lines 27 to 31) forces for operations sharing same resource do not overlap each other<br /></li>
<li><a id="org2c3a471"></a>(Lines 33 to 38) coumputes optimum solution<br /></li>
</ul>
</div>
<div id="outline-container-org1eaa12c" class="outline-2">
<h2 id="org1eaa12c">Colored N Queen</h2>
<div class="outline-text-2" id="text-org1eaa12c">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab.<span style="color: #a020f0;">_</span>, dsl.<span style="color: #a020f0;">_</span>

<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">n</span> <span style="color: #a020f0;">=</span> args(<span style="color: #008b8b;">0</span>).toInt
<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">c</span> <span style="color: #a020f0;">=</span> n

use(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">Sat4j</span>(<span style="color: #8b2252;">"glucose"</span>))

<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to n; color <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to c)
  int(<span style="color: #8b2252;">'q</span>(i,color), <span style="color: #008b8b;">1</span>, c)

<span style="color: #a020f0;">for</span> (color <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to c) {
  add(alldiff((<span style="color: #008b8b;">1</span> to n).map(i <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'q</span>(i,color))))
  add(alldiff((<span style="color: #008b8b;">1</span> to n).map(i <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'q</span>(i,color)+i)))
  add(alldiff((<span style="color: #008b8b;">1</span> to n).map(i <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'q</span>(i,color)-i)))
}

<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to n)
  add(alldiff((<span style="color: #008b8b;">1</span> to c).map(color <span style="color: #a020f0;">=&gt;</span> <span style="color: #8b2252;">'q</span>(i,color))))

<span style="color: #a020f0;">if</span> (find) {
  <span style="color: #a020f0;">for</span> (color <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to c) {
    <span style="color: #a020f0;">for</span> (row <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to n) {
      <span style="color: #a020f0;">var</span> <span style="color: #ff0000; font-weight: bold;">seq</span><span style="color: #a020f0;">:</span> <span style="color: #228b22;">Seq</span>[<span style="color: #008b8b;">Int</span>] <span style="color: #a020f0;">=</span> <span style="color: #008b8b;">Seq</span>.empty
      <span style="color: #a020f0;">for</span> (column <span style="color: #a020f0;">&lt;-</span> <span style="color: #008b8b;">1</span> to n)
        <span style="color: #a020f0;">if</span> (encoder.decode(<span style="color: #8b2252;">'q</span>(row,color)) == column)
          seq <span style="color: #a020f0;">=</span> seq :+ color
        <span style="color: #a020f0;">else</span>
          seq <span style="color: #a020f0;">=</span> seq :+ <span style="color: #008b8b;">0</span>
      println(seq.mkString(<span style="color: #8b2252;">" "</span>))
    }
    println(<span style="color: #8b2252;">"-----------------"</span>)
  }
}
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org1d2eced"></a>(Lines 1 to 3) import Scarab classes<br /></li>
<li><a id="org912b80a"></a>(Lines 5 to 6) size is given from command line<br /></li>
<li><a id="orgfc342bd"></a>(Lines 8) declares the use of Sat4j of Glucose setting.<br /></li>
<li><a id="org2f54bd4"></a>(Lines 10 to 11) declares integer variables representing queens<br /></li>
<li><a id="orgb27ccea"></a>(Lines 13 to 17) representing N-Queen constraints for each color<br /></li>
<li><a id="orgafe9e87"></a>(Lines 19 to 20) forces that Queens of each color do no overlap<br /></li>
<li><a id="org6a9780f"></a>(Lines 22 to 35) compute solutions and show the obtained placement<br /></li>
</ul>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="http://kix.istc.kobe-u.ac.jp/~soh/">Takehide Soh</a></p>
<p class="date">Created: 2019-05-01 水 14:21</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
